Revit 2027 API
ParameterTypeId.StructuralAnalyticalBeamHorizontalProjectionPlane Property
 "Horizontal Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalBeamHorizontalProjectionPlane { get; }
Public Shared ReadOnly Property StructuralAnalyticalBeamHorizontalProjectionPlane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalBeamHorizontalProjectionPlane {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalBeamHorizontalProjectionPlane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace